examples/phtEnthalpyFoam/3DHeatSource/system/fieldMinMax
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  v2012
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates the mimima and maxima of fields

\*---------------------------------------------------------------------------*/

type            fieldMinMax;
libs            (fieldFunctionObjects);

fields          ("T.solid");

location		false;

executeControl  writeTime;

// ************************************************************************* //
